
&НаСервереБезКонтекста
Процедура ВыполнитьОбменНаСервере()
	ВыборкаУзлов = ПланыОбмена.Филиалы.Выбрать();
	Пока ВыборкаУзлов.Следующий() Цикл  
		Если ВыборкаУзлов.Ссылка <> ПланыОбмена.Филиалы.ЭтотУзел() Тогда
		УзелОбъект = ВыборкаУзлов.ПолучитьОбъект();
		// Получить сообщение.
		УзелОбъект.ПрочитатьСообщениеСИзменениями();
		// Сформировать сообщение.
		УзелОбъект.ЗаписатьСообщениеСИзменениями();
	КонецЕсли;
КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	ВыполнитьОбменНаСервере();
КонецПроцедуры
